In [1]:
import pandas as pd

In [2]:
def read_in_chunks(file_path, sep='\t'):
    chunk_size = 1000  # adjust as needed
    chunks = pd.read_csv(file_path, sep=sep, chunksize=chunk_size)
    df = pd.concat(chunks)
    return df

In [3]:
tsv_file_paths = ['Data/name.basics.tsv', 'Data/title.akas.tsv', 
                 'Data/title.basics.tsv', 'Data/title.principals.tsv', 
                 'Data/title.ratings.tsv']
dfs = []
for file_path in tsv_file_paths:
    df = read_in_chunks(file_path)
    dfs.append(df)

In [4]:
df1 = dfs[0]
df2 = dfs[1]
df3 = dfs[2]
df4 = dfs[3]
df5 = dfs[4]

In [5]:
df6 = pd.read_json('Data/IMDB_reviews.json', lines=True)
df7 = pd.read_json('Data/IMDB_movie_details.json', lines=True)

In [6]:
df1.head(3)

,nconst,primaryName,birthYear,deathYear,primaryProfession,knownForTitles
0,nm0000001,Fred Astaire,1899,1987,"actor,miscellaneous,producer","tt0072308,tt0050419,tt0053137,tt0027125"
1,nm0000002,Lauren Bacall,1924,2014,"actress,soundtrack,archive_footage","tt0037382,tt0075213,tt0117057,tt0038355"
2,nm0000003,Brigitte Bardot,1934,\N,"actress,music_department,producer","tt0057345,tt0049189,tt0056404,tt0054452"

df1 contains people who have worked on or in movies.

In [7]:
df2.head(3)

,titleId,ordering,title,region,language,types,attributes,isOriginalTitle
0,tt0000001,1,Carmencita,\N,\N,original,\N,1
1,tt0000001,2,Carmencita,DE,\N,\N,literal title,0
2,tt0000001,3,Carmencita,US,\N,imdbDisplay,\N,0

df2 contains movie id and different names for the same movie

In [8]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 48348097 entries, 0 to 48348096
Data columns (total 8 columns):
 #   Column           Dtype
---  ------           -----
 0   titleId          object
 1   ordering         int64
 2   title            object
 3   region           object
 4   language         object
 5   types            object
 6   attributes       object
 7   isOriginalTitle  int64
dtypes: int64(2), object(6)
memory usage: 2.9+ GB

In [9]:
df2.replace('\\N', pd.NA, inplace=True)

In [10]:
df2.isnull().sum()

titleId                   0
ordering                  0
title                    35
region             10843862
language           15984678
types              33488143
attributes         48068847
isOriginalTitle           0
dtype: int64

In [11]:
df2.drop('attributes', axis=1, inplace=True)

In [12]:
df2.drop('ordering', axis=1, inplace=True)

In [13]:
df2['types'].unique()

array(['original', <NA>, 'imdbDisplay', 'alternative', 'festival', 'dvd',
       'working', 'tv', 'video', 'imdbDisplay\x02tv', 'alternative\x02tv',
       'imdbDisplay\x02working', 'imdbDisplay\x02festival',
       'working\x02tv', 'imdbDisplay\x02video', 'dvd\x02alternative',
       'tv\x02video', 'imdbDisplay\x02dvd', 'working\x02video',
       'working\x02festival', 'dvd\x02video', 'alternative\x02festival',
       'alternative\x02video', 'working\x02alternative'], dtype=object)

In [14]:
df3.head(3)

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0000001,short,Carmencita,Carmencita,0,1894,\N,1,"Documentary,Short"
1,tt0000002,short,Le clown et ses chiens,Le clown et ses chiens,0,1892,\N,5,"Animation,Short"
2,tt0000003,short,Pauvre Pierrot,Pauvre Pierrot,0,1892,\N,5,"Animation,Comedy,Romance"

df3 is movies and their years and genres

In [15]:
df3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10790736 entries, 0 to 10790735
Data columns (total 9 columns):
 #   Column          Dtype
---  ------          -----
 0   tconst          object
 1   titleType       object
 2   primaryTitle    object
 3   originalTitle   object
 4   isAdult         object
 5   startYear       object
 6   endYear         object
 7   runtimeMinutes  object
 8   genres          object
dtypes: object(9)
memory usage: 740.9+ MB

In [16]:
df3.replace('\\N', pd.NA, inplace=True)

In [17]:
df3.isnull().sum()

tconst                   0
titleType                0
primaryTitle            19
originalTitle           19
isAdult                  1
startYear          1406804
endYear           10666898
runtimeMinutes     7443113
genres              480417
dtype: int64

In [18]:
df3.drop('endYear', axis=1, inplace=True)

In [19]:
df4.head(3)

      tconst  ordering     nconst  category       job characters
0  tt0000001         1  nm1588970      self        \N   ["Self"]
1  tt0000001         2  nm0005690  director        \N         \N
2  tt0000001         3  nm0005690  producer  producer         \N

df4 is the movies and actor relationship

In [20]:
df5.head(3)

      tconst  averageRating  numVotes
0  tt0000001            5.7      2058
1  tt0000002            5.7       276
2  tt0000003            6.5      2015

df5 is avg rating and number of votes per movie

In [21]:
df5.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1439968 entries, 0 to 1439967
Data columns (total 3 columns):
 #   Column         Non-Null Count    Dtype
---  ------         --------------    -----
 0   tconst         1439968 non-null  object
 1   averageRating  1439968 non-null  float64
 2   numVotes       1439968 non-null  int64
dtypes: float64(1), int64(1), object(1)
memory usage: 33.0+ MB

In [22]:
df6.head(3)

,review_date,movie_id,user_id,is_spoiler,review_text,rating,review_summary
0,10 February 2006,tt0111161,ur1898687,True,"In its Oscar year, Shawshank Redemption (writt...",10,A classic piece of unforgettable film-making.
1,6 September 2000,tt0111161,ur0842118,True,The Shawshank Redemption is without a doubt on...,10,Simply amazing. The best film of the 90's.
2,3 August 2001,tt0111161,ur1285640,True,I believe that this film is the best story eve...,8,The best story ever told on film

In [23]:
user_id_column = df6['user_id']
new_df = pd.DataFrame(user_id_column, columns=['user_id'])
new_df.to_csv('user_ids.csv', index=False)

In [24]:
df7.head(3)

,movie_id,plot_summary,duration,genre,rating,release_date,plot_synopsis
0,tt0105112,"Former CIA analyst, Jack Ryan is in England wi...",1h 57min,"[Action, Thriller]",6.9,1992-06-05,"Jack Ryan (Ford) is on a ""working vacation"" in..."
1,tt1204975,"Billy (Michael Douglas), Paddy (Robert De Niro...",1h 45min,[Comedy],6.6,2013-11-01,Four boys around the age of 10 are friends in ...
2,tt0243655,"The setting is Camp Firewood, the year 1981. I...",1h 37min,"[Comedy, Romance]",6.7,2002-04-11,

In [25]:
df7.info()

<class 'pandas.core.frame.DataFrame'>
Index: 1572 entries, 0 to 1571
Data columns (total 7 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   movie_id       1572 non-null   object
 1   plot_summary   1572 non-null   object
 2   duration       1572 non-null   object
 3   genre          1572 non-null   object
 4   rating         1572 non-null   float64
 5   release_date   1572 non-null   object
 6   plot_synopsis  1572 non-null   object
dtypes: float64(1), object(6)
memory usage: 98.2+ KB

## Database structure

MsSQL: User table, movies table, payment_detail table (with ids)

MongoDB: Reviews, recommendations

Neo4j: Actors relationship, users relationships

## MsSQL

Movie: id, title, alternative titles, duration, plot_Summary, genre, realease_date/start year, rating/avg_rating

User: id, username, password, email, first_name, last_name, payment_details, friends that they follow, relationship to movies and reviews,

In [26]:
!pip install pyodbc

Requirement already satisfied: pyodbc in /Library/Frameworks/Python.framework/Versions/3.12/lib/python3.12/site-packages (5.1.0)

In [27]:
!pip install sqlalchemy pymssql

Requirement already satisfied: sqlalchemy in /Library/Frameworks/Python.framework/Versions/3.12/lib/python3.12/site-packages (2.0.30)
Requirement already satisfied: pymssql in /Library/Frameworks/Python.framework/Versions/3.12/lib/python3.12/site-packages (2.3.0)
Requirement already satisfied: typing-extensions>=4.6.0 in /Library/Frameworks/Python.framework/Versions/3.12/lib/python3.12/site-packages (from sqlalchemy) (4.11.0)

USER TABLE

In [28]:
import pandas as pd

# Read the CSV file
df_users = pd.read_csv('Data/users.csv')

In [29]:
df_users

,user_id,username,password,email,first_name,last_name,payment_details,role
0,ur1898687,johndoe1,P@ssw0rd123,john.doe1@example.com,John,Doe,pd0000001,rd0000001
1,ur0842118,janesmith,J@n3Smit#45,jane.smith@example.com,Jane,Smith,pd0000002,rd0000002
2,ur1285640,jimbrown,Br0wnie#789,jim.brown@example.com,Jim,Brown,pd0000003,rd0000003
3,ur1003471,jilljohnson,J!llybean76,jill.johnson@example.com,Jill,Johnson,pd0000004,rd0000003
4,ur0226855,jackwhite,Wh!teH0rse22,jack.white@example.com,Jack,White,pd0000005,rd0000003
...,...,...,...,...,...,...,...,...
196,ur3402930,josephd,J0s3phD3W!tt,joseph.dewitt@example.com,Joseph,Dewitt,pd0000197,rd0000003
197,ur2389420,richardb,R!ch@rdB@ss,rchard.bass@example.com,Richard,Bass,pd0000198,rd0000003
198,ur2039203,laurenc,L@ur3nC@mpb3ll,lauren.campbell@example.com,Lauren,Campbell,pd0000199,rd0000003
199,ur0000001,cph-caro,1234,cphcaro@gmail.com,Caroline,Hog,pd0000200,rd0000001
200,ur0000002,cph-mari,1234,cphmari@gmail.com,Maria,Mcnally,pd0000201,rd0000002

## Making movies table

In [30]:
# Merge the two DataFrames on the "movie_id" and "tconst" columns
merged_df = pd.merge(df7, df3[['tconst', 'primaryTitle', 'originalTitle']], left_on='movie_id', right_on='tconst', how='left')

# Drop the redundant 'tconst' column if needed
merged_df = merged_df.drop(columns=['tconst'])

# Display the first few rows of the merged DataFrame
print(merged_df.head())

    movie_id                                       plot_summary  duration  \
0  tt0105112  Former CIA analyst, Jack Ryan is in England wi...  1h 57min
1  tt1204975  Billy (Michael Douglas), Paddy (Robert De Niro...  1h 45min
2  tt0243655  The setting is Camp Firewood, the year 1981. I...  1h 37min
3  tt0040897  Fred C. Dobbs and Bob Curtin, both down on the...   2h 6min
4  tt0126886  Tracy Flick is running unopposed for this year...  1h 43min

                         genre  rating release_date  \
0           [Action, Thriller]     6.9   1992-06-05
1                     [Comedy]     6.6   2013-11-01
2            [Comedy, Romance]     6.7   2002-04-11
3  [Adventure, Drama, Western]     8.3   1948-01-24
4     [Comedy, Drama, Romance]     7.3   1999-05-07

                                       plot_synopsis  \
0  Jack Ryan (Ford) is on a "working vacation" in...
1  Four boys around the age of 10 are friends in ...
2
3  Fred Dobbs (Humphrey Bogart) and Bob Curtin (T...
4  Jim McAllister (Matthew Broderick) is a much-a...

                       primaryTitle                     originalTitle
0                     Patriot Games                     Patriot Games
1                        Last Vegas                        Last Vegas
2           Wet Hot American Summer           Wet Hot American Summer
3  The Treasure of the Sierra Madre  The Treasure of the Sierra Madre
4                          Election                          Election

In [31]:
merged_df

,movie_id,plot_summary,duration,genre,rating,release_date,plot_synopsis,primaryTitle,originalTitle
0,tt0105112,"Former CIA analyst, Jack Ryan is in England wi...",1h 57min,"[Action, Thriller]",6.9,1992-06-05,"Jack Ryan (Ford) is on a ""working vacation"" in...",Patriot Games,Patriot Games
1,tt1204975,"Billy (Michael Douglas), Paddy (Robert De Niro...",1h 45min,[Comedy],6.6,2013-11-01,Four boys around the age of 10 are friends in ...,Last Vegas,Last Vegas
2,tt0243655,"The setting is Camp Firewood, the year 1981. I...",1h 37min,"[Comedy, Romance]",6.7,2002-04-11,,Wet Hot American Summer,Wet Hot American Summer
3,tt0040897,"Fred C. Dobbs and Bob Curtin, both down on the...",2h 6min,"[Adventure, Drama, Western]",8.3,1948-01-24,Fred Dobbs (Humphrey Bogart) and Bob Curtin (T...,The Treasure of the Sierra Madre,The Treasure of the Sierra Madre
4,tt0126886,Tracy Flick is running unopposed for this year...,1h 43min,"[Comedy, Drama, Romance]",7.3,1999-05-07,Jim McAllister (Matthew Broderick) is a much-a...,Election,Election
...,...,...,...,...,...,...,...,...,...
1567,tt0289879,Evan Treborn grows up in a small town with his...,1h 53min,"[Sci-Fi, Thriller]",7.7,2004-01-23,"In the year 1998, Evan Treborn (Ashton Kutcher...",The Butterfly Effect,The Butterfly Effect
1568,tt1723811,Brandon is a 30-something man living in New Yo...,1h 41min,[Drama],7.2,2012-01-13,"Brandon (Michael Fassbender) is a successful, ...",Shame,Shame
1569,tt5013056,Evacuation of Allied soldiers from the British...,1h 46min,"[Action, Drama, History]",8.1,2017-07-21,The film alternates between three different pe...,Dunkirk,Dunkirk
1570,tt0104014/,"For a while now, beautiful 24-year-old Diana B...",1h 33min,"[Comedy, Drama]",5.3,1992-02-21,,NaN,NaN
1571,tt0114142/,"The marriage of David Burgess, a senior execut...",1h 32min,"[Drama, Thriller]",4.0,1999-01-29,,NaN,NaN

In [32]:
# Rename the columns
merged_df = merged_df.rename(columns={'primaryTitle': 'primary_title', 'originalTitle': 'original_title'})


# Define the desired column order
desired_order = ['movie_id', 'primary_title', 'original_title','plot_summary',
                 'duration', 'genre', 'rating', 'release_date', 'plot_synopsis'] + [col for col in merged_df.columns if col not in ['movie_id', 'primary_title', 'original_title','plot_summary',
                 'duration', 'genre', 'rating', 'release_date', 'plot_synopsis']]

# Reorder the DataFrame
merged_df = merged_df[desired_order]

In [33]:
# Save the result to a new CSV file
#merged_df.to_csv('merged_dataset.csv', index=False)

merged_df

,movie_id,primary_title,original_title,plot_summary,duration,genre,rating,release_date,plot_synopsis
0,tt0105112,Patriot Games,Patriot Games,"Former CIA analyst, Jack Ryan is in England wi...",1h 57min,"[Action, Thriller]",6.9,1992-06-05,"Jack Ryan (Ford) is on a ""working vacation"" in..."
1,tt1204975,Last Vegas,Last Vegas,"Billy (Michael Douglas), Paddy (Robert De Niro...",1h 45min,[Comedy],6.6,2013-11-01,Four boys around the age of 10 are friends in ...
2,tt0243655,Wet Hot American Summer,Wet Hot American Summer,"The setting is Camp Firewood, the year 1981. I...",1h 37min,"[Comedy, Romance]",6.7,2002-04-11,
3,tt0040897,The Treasure of the Sierra Madre,The Treasure of the Sierra Madre,"Fred C. Dobbs and Bob Curtin, both down on the...",2h 6min,"[Adventure, Drama, Western]",8.3,1948-01-24,Fred Dobbs (Humphrey Bogart) and Bob Curtin (T...
4,tt0126886,Election,Election,Tracy Flick is running unopposed for this year...,1h 43min,"[Comedy, Drama, Romance]",7.3,1999-05-07,Jim McAllister (Matthew Broderick) is a much-a...
...,...,...,...,...,...,...,...,...,...
1567,tt0289879,The Butterfly Effect,The Butterfly Effect,Evan Treborn grows up in a small town with his...,1h 53min,"[Sci-Fi, Thriller]",7.7,2004-01-23,"In the year 1998, Evan Treborn (Ashton Kutcher..."
1568,tt1723811,Shame,Shame,Brandon is a 30-something man living in New Yo...,1h 41min,[Drama],7.2,2012-01-13,"Brandon (Michael Fassbender) is a successful, ..."
1569,tt5013056,Dunkirk,Dunkirk,Evacuation of Allied soldiers from the British...,1h 46min,"[Action, Drama, History]",8.1,2017-07-21,The film alternates between three different pe...
1570,tt0104014/,NaN,NaN,"For a while now, beautiful 24-year-old Diana B...",1h 33min,"[Comedy, Drama]",5.3,1992-02-21,
1571,tt0114142/,NaN,NaN,"The marriage of David Burgess, a senior execut...",1h 32min,"[Drama, Thriller]",4.0,1999-01-29,

In [34]:
merged_df1 = merged_df.drop(columns=['genre'])
merged_df1

,movie_id,primary_title,original_title,plot_summary,duration,rating,release_date,plot_synopsis
0,tt0105112,Patriot Games,Patriot Games,"Former CIA analyst, Jack Ryan is in England wi...",1h 57min,6.9,1992-06-05,"Jack Ryan (Ford) is on a ""working vacation"" in..."
1,tt1204975,Last Vegas,Last Vegas,"Billy (Michael Douglas), Paddy (Robert De Niro...",1h 45min,6.6,2013-11-01,Four boys around the age of 10 are friends in ...
2,tt0243655,Wet Hot American Summer,Wet Hot American Summer,"The setting is Camp Firewood, the year 1981. I...",1h 37min,6.7,2002-04-11,
3,tt0040897,The Treasure of the Sierra Madre,The Treasure of the Sierra Madre,"Fred C. Dobbs and Bob Curtin, both down on the...",2h 6min,8.3,1948-01-24,Fred Dobbs (Humphrey Bogart) and Bob Curtin (T...
4,tt0126886,Election,Election,Tracy Flick is running unopposed for this year...,1h 43min,7.3,1999-05-07,Jim McAllister (Matthew Broderick) is a much-a...
...,...,...,...,...,...,...,...,...
1567,tt0289879,The Butterfly Effect,The Butterfly Effect,Evan Treborn grows up in a small town with his...,1h 53min,7.7,2004-01-23,"In the year 1998, Evan Treborn (Ashton Kutcher..."
1568,tt1723811,Shame,Shame,Brandon is a 30-something man living in New Yo...,1h 41min,7.2,2012-01-13,"Brandon (Michael Fassbender) is a successful, ..."
1569,tt5013056,Dunkirk,Dunkirk,Evacuation of Allied soldiers from the British...,1h 46min,8.1,2017-07-21,The film alternates between three different pe...
1570,tt0104014/,NaN,NaN,"For a while now, beautiful 24-year-old Diana B...",1h 33min,5.3,1992-02-21,
1571,tt0114142/,NaN,NaN,"The marriage of David Burgess, a senior execut...",1h 32min,4.0,1999-01-29,

In [35]:
merged_df1.to_csv('merged_dataset_ex_genre.csv', index=False)

In [41]:
merged_df

,movie_id,primary_title,original_title,plot_summary,duration,genre,rating,release_date,plot_synopsis
0,tt0105112,Patriot Games,Patriot Games,"Former CIA analyst, Jack Ryan is in England wi...",1h 57min,"[Action, Thriller]",6.9,1992-06-05,"Jack Ryan (Ford) is on a ""working vacation"" in..."
1,tt1204975,Last Vegas,Last Vegas,"Billy (Michael Douglas), Paddy (Robert De Niro...",1h 45min,[Comedy],6.6,2013-11-01,Four boys around the age of 10 are friends in ...
2,tt0243655,Wet Hot American Summer,Wet Hot American Summer,"The setting is Camp Firewood, the year 1981. I...",1h 37min,"[Comedy, Romance]",6.7,2002-04-11,
3,tt0040897,The Treasure of the Sierra Madre,The Treasure of the Sierra Madre,"Fred C. Dobbs and Bob Curtin, both down on the...",2h 6min,"[Adventure, Drama, Western]",8.3,1948-01-24,Fred Dobbs (Humphrey Bogart) and Bob Curtin (T...
4,tt0126886,Election,Election,Tracy Flick is running unopposed for this year...,1h 43min,"[Comedy, Drama, Romance]",7.3,1999-05-07,Jim McAllister (Matthew Broderick) is a much-a...
...,...,...,...,...,...,...,...,...,...
1567,tt0289879,The Butterfly Effect,The Butterfly Effect,Evan Treborn grows up in a small town with his...,1h 53min,"[Sci-Fi, Thriller]",7.7,2004-01-23,"In the year 1998, Evan Treborn (Ashton Kutcher..."
1568,tt1723811,Shame,Shame,Brandon is a 30-something man living in New Yo...,1h 41min,[Drama],7.2,2012-01-13,"Brandon (Michael Fassbender) is a successful, ..."
1569,tt5013056,Dunkirk,Dunkirk,Evacuation of Allied soldiers from the British...,1h 46min,"[Action, Drama, History]",8.1,2017-07-21,The film alternates between three different pe...
1570,tt0104014/,NaN,NaN,"For a while now, beautiful 24-year-old Diana B...",1h 33min,"[Comedy, Drama]",5.3,1992-02-21,
1571,tt0114142/,NaN,NaN,"The marriage of David Burgess, a senior execut...",1h 32min,"[Drama, Thriller]",4.0,1999-01-29,

### Genre table

In [45]:
genre_series = merged_df['genre']

# Explode the list-like column into separate rows
genre_df = merged_df.explode('genre')

# Reset index to get continuous indices
genre_df = genre_df.reset_index(drop=True)

# Create a new DataFrame for genres with a unique ID for each genre
genre_df = pd.DataFrame(genre_df['genre'].unique(), columns=['genre'])
genre_df['genre_id'] = ['gd{:07d}'.format(i+1) for i in range(len(genre_df))]


print(genre_df.head())
genre_df

       genre   genre_id
0     Action  gd0000001
1   Thriller  gd0000002
2     Comedy  gd0000003
3    Romance  gd0000004
4  Adventure  gd0000005

        genre   genre_id
0      Action  gd0000001
1    Thriller  gd0000002
2      Comedy  gd0000003
3     Romance  gd0000004
4   Adventure  gd0000005
5       Drama  gd0000006
6     Western  gd0000007
7      Sci-Fi  gd0000008
8     Fantasy  gd0000009
9      Family  gd0000010
10      Sport  gd0000011
11     Horror  gd0000012
12      Crime  gd0000013
13        War  gd0000014
14    Mystery  gd0000015
15  Biography  gd0000016
16    History  gd0000017
17      Music  gd0000018
18  Animation  gd0000019
19    Musical  gd0000020
20  Film-Noir  gd0000021

In [46]:
# Save the new genre DataFrame to a CSV file
genre_df.to_csv('genre_dataset.csv', index=False)

### Creating Movie-Genre table

In [51]:
merged_df['movie_id'] = merged_df['movie_id'].str.rstrip('/')

# Explode the list-like column into separate rows to ensure each movie has multiple rows corresponding to its genres
exploded_df = merged_df.explode('genre')

# Merge with genre_df to get genre_id for each genre
genre_id_mapping = pd.merge(exploded_df, genre_df, left_on='genre', right_on='genre', how='left')

# Select only the movie_id and genre_id columns
movie_genre_mapping = genre_id_mapping[['movie_id', 'genre_id']]

print(movie_genre_mapping.head())

    movie_id   genre_id
0  tt0105112  gd0000001
1  tt0105112  gd0000002
2  tt1204975  gd0000003
3  tt0243655  gd0000003
4  tt0243655  gd0000004

In [52]:
movie_genre_mapping

       movie_id   genre_id
0     tt0105112  gd0000001
1     tt0105112  gd0000002
2     tt1204975  gd0000003
3     tt0243655  gd0000003
4     tt0243655  gd0000004
...         ...        ...
4120  tt5013056  gd0000017
4121  tt0104014  gd0000003
4122  tt0104014  gd0000006
4123  tt0114142  gd0000006
4124  tt0114142  gd0000002

[4125 rows x 2 columns]

In [53]:
# Save the movie-genre mapping dataset to a CSV file
movie_genre_mapping.to_csv('movie_genre_mapping.csv', index=False)

In [36]:
cursor = conn.cursor()

# SQL query to create table
create_table_query = '''
CREATE TABLE movie_test (
    movie_id VARCHAR PRIMARY KEY,
    plot_summary TEXT,
    duration TEXT,
    genre TEXT,
    rating FLOAT,
    release_date TEXT,
    plot_synopsis TEXT
);
'''

##CREATE TABLE movie_test (
    #movie_id VARCHAR PRIMARY KEY,
    #primary_title,
    #orginal_title,
    #plot_summary TEXT,
    #duration TEXT,
    #rating FLOAT,
    #release_date TEXT,
    #plot_synopsis TEXT
#);

# Execute the SQL query to create the table
cursor.execute(create_table_query)

# Commit the changes
conn.commit()

# Close the cursor and connection
cursor.close()
conn.close()

NameError: name 'conn' is not defined

USER TABLE:

ROLES = viewer, certified, admin

GENRE TABLE:

Genres = action, thriller, comedy, romance, drama, western, adventure, action, sci-fi, fantasy, 
family, horror, sport, crime, war, mystery,